
# Data Loading, Storage, and File Formats


* Topic Reading and Writing Data in Text Format  
Parsing functions in pandas  

* read_csv = load delimited data from a file, URL, or file-like   
object; use comma as default delimiter
* read_excel = Read tabular data from an Excel XLS or XLSX file
* read_html = Read all tables found in the given HTML document

# common options in these functions  


* Indexing  
Can treat one or more columns as the returned DataFrame, and whether to get
column names from the file, the user, or not at all.  
  
  
* Type inference and data conversion  
This includes the user-defined value conversions and custom list of missing value
markers.
  
  
* Datetime parsing  
Includes combining capability, including combining date and time information
spread over multiple columns into a single column in the result.  


* Iterating  
Support for iterating over chunks of very large files.  
  
  
* Unclean data issues  
Skipping rows or a footer, comments, or other minor things like numeric data with thousands separated by commas.


download examples folder from our provide link or book resources

# loading it into pandas data frame

In [5]:
import pandas as pd
#sample_df= pd.read_csv("sample.csv")
#print(sample_df)
#What if no column names available
#(we are removing first row)

sample_df= pd.read_csv("examples/sample.csv")
print(sample_df)
print("\n")

# we can change the column names while loading data
sample_df=pd.read_csv("examples/sample.csv",skiprows=1,
                     names=['id', 'name', 'ch', 'ph', 'en', 'math'])
print(sample_df)

  studentid         name   chimestry   physics   english   math
0       A01     arif ali          20        30        40     50
1       A02  kamran khan          30        40        50     60
2       A03   imran ali           40        50        60     70
3       A04  kashif khan          50        60        70     80


    id         name  ch  ph  en  math
0  A01     arif ali  20  30  40    50
1  A02  kamran khan  30  40  50    60
2  A03   imran ali   40  50  60    70
3  A04  kashif khan  50  60  70    80

In [8]:
# refer the book for other details like header=None  etc.

In [8]:
sample_df= pd.read_csv("examples/ex1.csv")
sample_df
sample_df.plot()

# Hierarchal Index

In [4]:
s2_df = pd.read_csv("examples/sample2.csv")
print(s2_df)
# we have to specifiy which column will be used as index
parsed = pd.read_csv("examples/sample2)
parsed
#s2_df

NameError: name 'pd' is not defined

In [ ]:
# use of other delimiter are also possible
#In some cases, a table might not have a fixed delimiter, using whitespace or some
#other pattern to separate fields
#checkout [21] and [24]

# Handling Missing Values

In [33]:
#something,a,b,c,d,message
#one,1,2,3,4,NA
#two,5,6,,8,world
#three,9,10,11,12,foo
result = pd.read_csv('examples/sample3.csv')
print(result)
#result = pd.read_csv('examples/sample3.csv', na_values=['NULL'])#
#print(result)
# changing data while loading in dataframe
#diconary=  column name : [source values, target value]#
sentinels = {'message': ['foo', 'NA']}
pd.read_csv('examples/sample3.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

Handling missing values is an important and frequently nuanced part of the file parsing process. Missing data is usually either not present (empty string) or marked by
some sentinel value. By default, pandas uses a set of commonly occurring sentinels,
such as NA and NULL

# Reading and  Text Files in Pieces

In [ ]:
#Creating A sample csv/Excel file
https://www.kaggle.com/iabhishekofficial/mobile-price-classification#train.csv

In [ ]:
#extracting selected rows from a large datasets
pd.read_csv('datasets/train.csv', nrows=200)

In [69]:
#To read a file in pieces, specify a chunksize as a number of rows:
chunks = pd.read_csv('datasets/train.csv', chunksize=200)
#print(type(chunks), print(chunks) )

chunkList = []
for chunk in chunks:
	# each chunk will work as dataframe)
	#print(type(chunk), len(chunk))
    #print(chunk.head())
    chunkList.append(chunk)

df = chunkList[2] 
df.head()

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
400,1266,0,1.9,1,0,1,7,0.2,184,3,...,346,1468,2532,10,5,4,1,1,1,2
401,1042,0,2.7,1,16,1,50,0.8,93,7,...,727,1705,3215,18,0,20,1,1,1,3
402,1479,0,0.5,0,8,0,19,0.6,156,3,...,180,1476,3323,13,12,6,1,0,1,3
403,1476,1,1.2,1,0,1,55,0.1,171,4,...,1641,1666,1529,13,8,3,1,0,1,2
404,1552,1,2.2,0,6,1,13,0.2,123,6,...,269,1026,2403,9,2,9,1,1,1,2

In [72]:
data = list(open('examples/ex3.txt'))
print(data)
# use spaces (one or more ) as delimiter 
result = pd.read_table('examples/ex3.txt', sep='\s+')
result

['            A         B         C\n', 'aaa -0.264438 -1.026059 -0.619500\n', 'bbb  0.927272  0.302904 -0.032399\n', 'ccc -0.264273 -0.386314 -0.217601\n', 'ddd -0.871858 -0.348382  1.100491\n']

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [74]:
df = pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
#Table 6-2. Some read_csv/read_table function arguments

# Writing Data to Text Format

In [78]:
data = pd.read_csv('examples/ex5.csv')
print(data)
data.to_csv('examples/out.csv')

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [84]:
import numpy as np
dates = pd.date_range('1/1/2000', periods=7)
#print(dates)
ts = pd.Series(np.arange(7), index=dates)
ts
ts.to_csv("examples/tseries.csv")

# JSON Data
short for JavaScript Object Notation

In [90]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
#print(obj)
# same like dictionary
data = pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

# XML and HTML: Web   data loading in to dataframe

In [17]:
#conda install lxml
# conda install -c anaconda beautifulsoup4 
# htconda install -c anaconda html5lib
import pandas as pd
tables = pd.read_html('examples/fdic_failed_bank_list.html')
# tables variable type is not dataframe, its list
print(type(tables))
print(len(tables))
failures_df = tables[0]
print(type(failures_df))
print(failures_df.shape)
# warning: data is bit lengthy in this data frame
print(failures_df.columns)
len(failures_df)
print(failures_df["City"].head())
print(failures_df["Bank Name"].head())
print(failures_df.head())

<class 'list'>
1
<class 'pandas.core.frame.DataFrame'>
(547, 7)
Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')
0           Mulberry
1           Woodbury
2    King of Prussia
3            Memphis
4          Milwaukee
Name: City, dtype: object
0                     Allied Bank
1    The Woodbury Banking Company
2          First CornerStone Bank
3              Trust Company Bank
4      North Milwaukee State Bank
Name: Bank Name, dtype: object
                      Bank Name             City  ST   CERT  \
0                   Allied Bank         Mulberry  AR     91
1  The Woodbury Banking Company         Woodbury  GA  11297
2        First CornerStone Bank  King of Prussia  PA  35312
3            Trust Company Bank          Memphis  TN   9956
4    North Milwaukee State Bank        Milwaukee  WI  20364

                 Acquiring Institution        Closing Date       Updated Date
0                         Today's Bank  September 23, 2016  November 17, 2016
1                          United Bank     August 19, 2016  November 17, 2016
2  First-Citizens Bank & Trust Company         May 6, 2016  September 6, 2016
3           The Bank of Fayette County      April 29, 2016  September 6, 2016
4  First-Citizens Bank & Trust Company      March 11, 2016      June 16, 2016

In [109]:
# for large and complicated dataframe, try to extract
# data as series for review and analysis
# here we converted a column into a new series of date type
close_timestamps = pd.to_datetime(failures['Closing Date'])
print(type(close_timestamps),close_timestamps)

<class 'pandas.core.series.Series'> 0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
5     2015-10-02
6     2015-10-02
7     2015-07-10
8     2015-05-08
9     2015-02-27
10    2015-02-13
11    2015-01-23
12    2015-01-16
13    2014-12-19
14    2014-11-07
15    2014-10-24
16    2014-10-17
17    2014-07-25
18    2014-07-18
19    2014-06-27
20    2014-06-20
21    2014-06-20
22    2014-05-30
23    2014-05-23
24    2014-05-16
25    2014-04-25
26    2014-02-28
27    2014-02-28
28    2014-01-31
29    2014-01-24
         ...
517   2008-05-09
518   2008-03-07
519   2008-01-25
520   2007-10-04
521   2007-09-28
522   2007-02-02
523   2004-06-25
524   2004-03-19
525   2004-03-12
526   2004-02-14
527   2003-11-14
528   2003-05-09
529   2003-02-07
530   2002-12-17
531   2002-11-08
532   2002-09-30
533   2002-06-27
534   2002-06-26
535   2002-03-28
536   2002-03-01
537   2002-02-07
538   2002-02-01
539   2002-01-18
540   2002-01-11
541   2001-09-07
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [ ]:
# Binary Data Formats

In [ ]:
frame = pd.read_csv('examples/ex1.csv')
frame.to_pickle('examples/frame_pickle')
pd.read_pickle('examples/frame_pickle')

In [5]:
# Using HDF5 Format
import numpy as np
import pandas as pd
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
print(store)
x=store.obj1
print(type(x))
print(x.head())
print('--------------')
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()
frame.to_hdf('mydata.h5', 'obj3', format='table')
frame = pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

<class 'pandas.core.frame.DataFrame'>
          a
0  0.721234
1 -0.602571
2  0.420059
3  2.556634
4 -1.070036
--------------

In [ ]:
# Reading Microsoft Excel Files

In [2]:
#reading
import pandas as pd

xlsx = pd.ExcelFile('examples/ex1.xlsx')
pd.read_excel(xlsx, 'Sheet1')
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')
# writing
writer = pd.ExcelWriter('examples/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()
# alternative option for single sheet
frame.to_excel('examples/ex2.xlsx')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
# Interacting with Web APIs

In [1]:
import requests
import numpy as np
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
#print(resp)
data = resp.json()
print(type(data))
#print(data)

<class 'dict'>

In [12]:
#data_dict = data[0]
#print(data_dict['title'])
#print(data_dict.keys())
issues = pd.DataFrame(data, 
                    columns=['number', 'title','labels', 'state'])

#issues = pd.DataFrame(data)
issues.head()
#print(issues[['number', 'title']].head())

   number                                              title labels state
0   29334  BUG: assignment to multiple columns when some ...     []  open
1   29333                              CLN: type annotations     []  open
2   29332  maybe_upcast_putmask: require other to be a sc...     []  open
3   29331                REF: implement maybe_promote_scalar     []  open
4   29330  conda env create --file environment.yaml Fails...     []  open

In [ ]:
#Interacting with Databases

In [14]:
#conda install -c anaconda sqlite 


import sqlite3

#creating table
query = """ CREATE TABLE test(a VARCHAR(20), 
        b VARCHAR(20),c REAL,
        d INTEGER);  """
# creating database file
con = sqlite3.connect('mydata.sqlite')
#running query
con.execute(query)
# table created
con.commit()
# done

OperationalError: table test already exists

In [15]:
# inserting data
#preparing data
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)
       ]
# preparing insert statement
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
# running insert statement
con.executemany(stmt, data)
#finalizing data saving
con.commit()

In [16]:
#selecting/extracting data
cursor = con.execute('select * from test')
rows = cursor.fetchall()
print(type(rows), rows)

<class 'list'> [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5), ('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]

In [3]:
#print(cursor.description)
data_df = pd.DataFrame(rows, columns=[x[0] for x in cursor.description])
data_df

NameError: name 'pd' is not defined

In [20]:
#conda install -c anaconda sqlalchemy 
# using sqlalchemy 
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
data_df =pd.read_sql('select * from test', db)
data_df

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

In [1]:
#end of six chapter